[
    {
        "id": "f892dc3e",
        "title": "Booki - Intégration HTML & CSS",
        "pictures": [
			"https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Booki_01_o8okga.webp",
            "https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Booki_02_hqwvvt.webp"
		],
        "links": {
			"github": "https://github.com/V4inwald/Openclassrooms_web_dev_project_2"
		},
        "tags": [
            "HTML",
            "CSS",
            "Figma",
            "Git",
            "Github",
            "Github Pages",
            "Windows",
            "Visual Studio Code",
            "Trello",
            "Slack"
        ],
        "description" : "Integration d'un site en HTML & CSS en suivant les maquettes...",
        "context": "Il s'agit d'un projet de la formation OpenClassrooms, voici quel en était le scénario. Ce projet consistait à créer la page d'accueil d'une agence de voyage pour la start-up Booki. En tant que développeur web frontend, j'ai été chargé d'intégrer l'interface du site en HTML et CSS. Les maquettes du site pour les versions desktop, tablette et mobile m'ont été fournies par l'UI designer, et j'ai dû respecter les spécifications techniques établies en collaboration avec la CTO. L'objectif du projet était d'intégrer les maquettes en utilisant uniquement du HTML et CSS.",
        "details": "J'ai commencé ce projet par la configuration de mon environnement de développement, et j'ai utilisé Git pour versionner le projet ainsi que GitHub. Une des problématiques importantes était de respecter les maquettes Figma afin d'atteindre le résultat voulu, principalement pour le design responsive. J'ai utilisé des balises sémantiques pour le HTML et fait attention à l'organisation du CSS que j'ai divisé en différentes feuilles de style par média query."
    },
    {
        "id": "a1b2c3d4",
        "title": "Sophie Bluel - Interface dynamique Javascript",
        "pictures": [
			"https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897221/Portfolio-images/Sophie-Bluel_01_ltrh5t.webp"
		],
        "links": {
			"github": "https://github.com/V4inwald/Openclassrooms-portfolio-architecte-sophie-bluel"
		},
        "tags": [
            "Javascript",
            "Swagger",
            "Postman",
            "Figma",
            "HTML",
            "CSS",
            "Git",
            "Github",
            "Prettier", 
            "Windows",
            "Visual Studio Code",
            "Trello",
            "Slack"
        ],
        "description" : "Création d'un site dynamique avec Javascript interagissant avec une API...",
        "context": "Il s'agit d'un projet de la formation OpenClassrooms, voici quel en était le scénario. Je travaille comme développeur front-end pour l'agence ArchiWebos. En renfort d'une équipe, je suis chargé de développer la page de présentation des travaux de l'architecte, la page de connexion de l'administrateur du site et la modale pour uploader de nouveaux médias. J'ai reçu les maquettes, le code back-end et le code front-end d'origine pour mener à bien ce projet. Lors de ce projet je ne pouvais utiliser que HTML/CSS ainsi que Javascript, je ne pouvais utiliser aucun Framework.",
        "details": "J'ai relevé le défi de créer une interface dynamique en utilisant uniquement HTML, CSS et JavaScript, sans recourir à des frameworks. J'ai créé la page de connexion de l'administrateur depuis zéro en utilisant des formulaires et JavaScript. J'ai également implémenté une modale pour uploader de nouveaux médias. J'ai collaboré avec l'équipe en utilisant Git et GitHub pour versionner mon code et suivre les tâches attribuées sur le Kanban. Afin de mener à bien ce projet j'ai dû apprendre à manipuler le DOM, récupérer des données utilisateur et gérer des événements avec JavaScript, ainsi que communiquer avec une API REST pour récupérer les données et images. Ce projet m'à permis de renforcer mes capacités en JavaScript"
    },
    {
        "id": "e5f6g7h8",
        "title": "Menu Maker - Gestion de Projet ",
        "pictures": [
            "https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Menu-maker_01_jmfscm.webp"
		],
        "links": {
            "notion": "https://lavender-raft-2a7.notion.site/ceba3559a4cf4ad8a9ff015b76207cb7?v=9313d3f826c64179a035ee7137a15423",
			"spécifications techniques": "https://docs.google.com/document/d/1XGlvq7Ci9cSx4R94xAYLovlw-3Y4bOru0ncym_Y2I9Q/edit?usp=sharing"
		},
        "tags": [
            "Notion",
            "AGILE", 
            "Slack",
            "Veille",
            "Google Slides", 
            "Google Docs",
            "Windows"
        ],
        "description" : "Gestion de projet Agile: création de spécifications techniques et d'un sprint backlog...",
        "context": "Il s'agit d'un projet de la formation OpenClassrooms, voici quel en était le scénario. Je suis développeur front-end au sein de l'agence Webgencia. On m'a confié une mission de planification plutôt que de développement. Mon client, Qwenta, souhaite créer un site nommé \"Menu Maker\" qui permettra aux restaurateurs d'afficher et de mettre en page leurs menus facilement. Je travaille en collaboration avec le Product Owner, pour préparer la réunion de validation du projet avec le chef de projet chez Qwenta. J'ai eu trois tâches à réaliser : développer un système de veille pour générer des idées, définir les spécifications techniques du site et organiser la gestion de projet.",
        "details": "L'enjeu clé était de gérer efficacement un projet Agile en établissant des spécifications techniques et un sprint backlog. J'ai donc développé un système de veille afin de rassembler des informations utiles et de pouvoir m'aider à définir des spécifications techniques. La veille accomplie j'ai défini les spécifications techniques du site et organisé la gestion du projet avec un tableau Kanban sur notion. La difficulté principale était d'attribuer les story points seul sans l'aide d'un outil tel que le planning poker. Suite à ceci, j'ai présenté la solution technique lors d'une présentation claire. Cette expérience m'a permis de travailler mes compétences en gestion de projet agile et veille technologique."
    },
    {
        "id": "9i8j7h6g",
        "title": "Nina Carducci - Débug et optimisation",
        "pictures": [
			"https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897221/Portfolio-images/Nina-Carducci_01_yjuzoc.webp"
		],
        "links": {
			"github": "https://github.com/V4inwald/Openclassrooms-optimisation-site-nina-carducci",
			"rapport": "https://docs.google.com/document/d/1dr7zdCKLNYNgEFVb8cpRB4gvOUGJkwLqbdabNKCqj7A/edit#heading=h.gjdgxs"
		},
        "tags": [
            "SEO",
            "Wave",
            "Rich Snippet",
            "Google Lighthouse",
            "Github Pages",
            "Windows",
            "Git", 
            "Github",
            "Visual Studio Code",
            "Prettier",
            "Notion",
            "Slack"
        ],
        "description" : "Débuguer, optimiser le SEO et l'accessibilité d'un site...",
        "context": "Il s'agit d'un projet de la formation OpenClassrooms, voici quel en était le scénario. En tant que développeur freelance, j'ai été contacté par Nina Carducci, une photographe professionnelle, qui souhaite optimiser son site web. Elle a exprimé le besoin d'améliorer les performances de son site, son référencement SEO, et de corriger certains bugs dans le code. Après avoir proposé mes services et fourni un rapport d'audit détaillé, nous avons convenu d'un rendez-vous pour discuter des details de l'optimisation.",
        "details": "Dans le cadre de ce projet, j'ai travaillé sur l'optimisation du site web de la photographe Nina Carducci (nina-carducci.github.io). L'objectif principal était de débuguer et d'optimiser le site web de Nina Carducci, ce qui impliquait de résoudre des problèmes d'accessibilité, de performances et de SEO.Pour cela, j'ai utilisé plusieurs outils et techniques, dont Google Lighthouse et l'extension Wave pour évaluer les performances et l'accessibilité du site. J'ai également mis en place des méthodes d'optimisation des images et du code afin d'améliorer le temps de chargement et le référencement SEO. Enfin, j'ai débuggé certains aspects du site, notamment la navigation dans la modale de la galerie et l'affichage des filtres. À la fin du projet, j'ai livré un rapport détaillé présentant toutes les modifications apportées et leurs impacts sur le site."
    },
    {
        "id": "b4a3e2d1",
        "title": "Kasa - Application web React",
        "pictures": [
			"https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Kasa_01_ojwtqz.webp",
            "https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Kasa_02_vzckez.webp"
		],
        "links": {
			"github": "https://github.com/V4inwald/Openclassrooms-site-Kasa"
		},
        "tags": [
            "React",
            "Create React App",
            "SaSS",
            "Javascript",
            "ESLint",
            "Prettier",
            "HTML",
            "CSS",
            "Figma",
            "Git",
            "Github", 
            "Npm",
            "Notion",
            "Slack",
            "React Router",
            "Windows", 
            "WSL", 
            "Visual Studio Code"

        ],
        "description" : "Création d'une Single Page Application avec React...",
        "context": "Il s'agit d'un projet de la formation OpenClassrooms, voici quel en était le scénario. En tant que développeur front-end freelance, j'ai été engagé par Kasa, une entreprise spécialisée dans la location d'appartements entre particuliers en France. Mon objectif était de moderniser leur plateforme web en utilisant React. J'ai reçu des maquettes Figma du designer et quelques contraintes techniques à respecter. Le back-end n'étant pas encore développé j'ai eu accès à un fichier JSON contenant les 20 dernières annonces de logements pour construire le front-end.",
        "details": "J'ai réalisé la refonte front-end de la plateforme web de Kasa en utilisant React, Sass et React Router. J'ai intégré le site en suivant les maquettes Figma. J'ai dû créer un Slideshow pour les images des annonces en respectant certaines contraintes. J'ai aussi beaucoup utilisé le State principalement pour les composants Collapse. Apprendre à utiliser React et plusieurs de ses fonctionnalités à été un défi initialement mais je suis sorti de ce projet en comprenant bien mieux comment React fonctionne. De plus j'ai aussi pu utiliser SaSS et m'habituer aux avantages d'un préprocesseur CSS"
    },
    {
        "id": "0k9l8m7n",
        "title": "Mon vieux grimoire - Backend NodeJs",
        "pictures": [
			"https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Mon-vieux-grimoire_01_xz8cwx.webp"
		],
        "links": {
			"github": "https://github.com/V4inwald/oc-mon-vieux-grimoire"
		},
        "tags": [
            "NodeJS",
            "ExpressJS",
            "MongoDB",
            "Postman",
            "API Rest",
            "Git",
            "Github",
            "Npm",
            "Notion",
            "Slack",
            "Windows", 
            "WSL", 
            "Visual Studio Code"
        ],
        "description" : "Création du Backend d'un site avec NodeJS...",
        "context": "Il s'agit d'un projet de la formation OpenClassrooms, voici quel en était le scénario. En tant que développeur back-end en freelance, j'ai été contacté par un développeur front-end pour travailler ensemble sur un nouveau projet. Il s'agit de créer un site de notation de livres nommé \"Mon Vieux Grimoire\". Le front-end à déja été développé en React, ma mission quand à consistait à développer la partie back-end. Nous avons reçu les spécifications fonctionnelles et la maquette du site, et j'ai mis en place l'API en suivant les spécifications techniques fournies. Le projet visait à permettre aux membres de noter et référencer des livres, avec une attention particulière à la prise en compte du Green Code en optimisant la taille des images envoyées par les utilisateurs.",
        "details": "Dans ce projet, j'ai développé le back-end avec NodeJS, ExpressJS et Nodemon (pour faciliter le développement). La base de données a été créée avec MongoDB et les modèles de données gérés avec Mongoose. Initialement sécuriser l'application n'était pas évident mais à force de recherches et d'essais j'ai fini par trouver comment faire. J'ai ensuite tenté d'appliquer les bonnes pratiques de sécurité de l'OWASP pour protéger l'application contre les failles courantes. J'ai, de plus, optimisé les images pour respecter les recommandations du Green Code. Le résultat est un back-end robuste et sécurisé qui s'intègre parfaitement avec le front-end déjà développé, permettant une application fonctionnelle et performante pour les utilisateurs."
    },
    {
        "id": "p6q5r4s3",
        "title": "Portfolio Josemaria Links - Application web React",
        "pictures": [
			"https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Josemaria-links_01_wjtzje.webp",
            "https://res.cloudinary.com/dh3vbx78h/image/upload/v1690897220/Portfolio-images/Josemaria-links_02_rhmudp.webp"
		],
        "links": {
			"github": "https://github.com/V4inwald/V4inwald.github.io",
			"figma": "https://www.figma.com/file/q08vV3hiaknOYJOElFs9OE/Maquette-Portefolio?type=design&node-id=1%3A2&mode=design&t=ycJ6ZAYfvvdV4nuT-1"
		},
        "tags": [
            "Github Actions",
            "Bootstrap",
            "Vite",
            "React",
            "React Router",
            "Javascript",
            "ESLint",
            "Prettier",
            "SaSS",
            "HTML",
            "CSS",
            "Figma",
            "Git",
            "Github",
            "Github Pages",
            "Npm",
            "Notion",
            "Slack",
            "Windows", 
            "WSL", 
            "Visual Studio Code"

        ],
        "description" : "Création de mon Portfolio en React...",
        "context": "Afin de trouver mon premier emploi developpeur web je crée ce portfolio que vous regardez actuellement. Le défi majeur à été de créer un portfolio attrayant tout en gardant un design sobre et élégant",
        "details": "Avant de me lancer sur le projet j'ai créé une maquette simple qui avait pour but de servir d'inspiration pour ce projet. Coté développement j'ai à nouveau utilisé React mais avec Vite vu que Create React App est déprécié. J'ai aussi utilisé Bootstrap et SaSS afin de faciliter la gestion du CSS. De plus j'ai utilisé Github Actions afin de créer une pipeline d'intégration continue qui déploie le site sur Github Pages lors du push sur la branche main. J'ai aussi pu à travers ce projet compléter mes compétences en React, et implémenter des animations"
    }
]